const langs = {
  info_title:
    "你好！我是 Haneko，一個可以讓你線上看本的機器人，按下下方按鈕以查看更多關於我的資訊",
  info_Uptime: "上線時間",
  info_Servers: "伺服器數量",
  info_MemoryUsage: "記憶體使用率 (Used / Total / Rss)",
  info_Devs: "開發者",

  none: "`無`",
  Ping: "延遲",
  Switch: "切換",
  Refresh: "刷新",
  support_server: "加入支持伺服器！",
  support: "遇到錯誤或想提供建議?\n請點擊下方按鈕加入支持伺服器並建立貼文！",

  nhentai_nsfw: "請在 NSFW 頻道使用這個指令",
  nhentai_searching: "搜尋中...",
  nhentai_nofound: "搜尋不到此本",
  nhentai_nofound2: "沒有搜尋結果",

  nsfw_noper: "你需要 `編輯頻道` 權限才能使用這個指令",
  nsfw_unlock: "🔓 現在不需要在 NSFW 頻道就可以看本了",
  nsfw_lock: "🔒 現在需要在 NSFW 頻道才可以看本",

  team_addself: "請不要添加自己！",
  team_addfail: "添加失敗！",
  team_addsus: "添加成功！",
  team_addesc: "<z> 已經在你的團隊中！",
  team_addesc2: "已添加 <z> 至你的團隊，現在他可以操控你的本子",
  team_removefail: "刪除失敗！",
  team_removeself: "你無法刪除自己！",
  team_removedesc: "<z> 不在你的團隊中！",
  team_removesus: "刪除成功！",
  team_removedesc2: "已從你的團隊中刪除 <z>，現在他無法操控你的本子",
  team_list: "<z> 的團隊成員",

  book_onlyself: "你只能操作自己的本喔！",
  book_close: "此書已由 <z> 關閉",
};

module.exports = langs;
